{
	"speakers": [
		{
			"firstName": "Elif",
			"lastName": "Boncuk",
			"jobTitle": "Senior Software Specialist",
			"company": "Garanti Technology (BBVA)",
			"biography": "Elif Boncuk has been working on mobile technologies especially on Android (since Eclair) and also IOS as a full-stack developer since the team formation in her current company. She is a Senior Software Specialist at Garanti Technology.\nHer passionate about Android is making apps more performant.\nElif is engaged with Google Developer Group and Women Techmakers Istanbul as organizer. She loves to speak at tech events and also organize and attend to them. She blogs in her native language at her blog(elifboncuk.com) about everything but mostly tech and also at Medium in English and only tech.\nIn addition, she loves to travel and she is a professional photographer but her favourite photography object is Android sculpture. You can find her taking photos with Androids at any time.",
			"picture": "http://2018.appbuilders.ch/images/speakers/elif.jpg",
			"twitter": "elifbon_",
			"speakerId": 50,
			"isStory": false
		},
		{
			"firstName": "Alexsander",
			"lastName": "Akers",
			"jobTitle": "Software Engineer",
			"company": "Microsoft To-Do",
			"biography": "Alex is a software engineer at Microsoft Berlin, where he works on To-Do for both iOS and macOS. His previous mobile experience includes Branch in New York City and Facebook in London on Rooms and React Native.",
			"picture": "http://2018.appbuilders.ch/images/speakers/alex.jpg",
			"twitter": "a2",
			"speakerId": 1,
			"isStory": false
		},
		{
			"firstName": "John",
			"lastName": "Sundell",
			"jobTitle": "Creator of Swift by Sundell",
			"company": "",
			"biography": "Programmer, speaker, podcaster, blogger, game dev 👨‍💻. Making @swiftbysundell and co-host of @stacktracepod.",
			"picture": "http://2018.appbuilders.ch/images/speakers/john.jpg",
			"twitter": "johnsundell",
			"speakerId": 2,
			"isStory": false
		},
		{
			"firstName": "Graham",
			"lastName": "Lee",
			"jobTitle": "Head of Architecture",
			"company": "Wealth Wizards",
			"biography": "Graham heads up software architecture and data strategy at Wealth Wizards, a financial technology company in Leamington Spa, England. He has spent a long time in the software industry and even occasionally enjoys it.",
			"picture": "http://2018.appbuilders.ch/images/speakers/graham.jpg",
			"twitter": "iwasleeg",
			"speakerId": 3,
			"isStory": false
		},
		{
			"firstName": "Ana",
			"lastName": "Baotić",
			"jobTitle": "Project Manager",
			"company": "Asseco SEE",
			"biography": "Ana is a software engineer with over 5 years experience in Android.\nDuring college she focused on various e-learning projects and plagiarism detection. After getting her Masters degree in CS, she started developing for Android, working on various projects in the telecommunication, medical and travel industry. After switching to banking and security, in 2016 she took the role of Technical Manager of Mobile banking.\nIn addition to coding, she loves organising workshops and working directly with clients, helping to close the gap between the technical and practical in mobile.",
			"picture": "http://2018.appbuilders.ch/images/speakers/ana.jpg",
			"twitter": "abaotic",
			"speakerId": 4,
			"isStory": false
		},
		{
			"firstName": "Phillip",
			"lastName": "Shoemaker",
			"jobTitle": "Advisor and Investor",
			"company": "",
			"biography": "Advisor and Investor",
			"picture": "http://2018.appbuilders.ch/images/speakers/phillip.jpg",
			"twitter": "",
			"speakerId": 5,
			"isStory": false
		},
		{
			"firstName": "Krzysztof",
			"lastName": "Zabłocki",
			"jobTitle": "Lead iOS developer",
			"company": "The New York Times",
			"biography": "Krzysztof is an iOS developer, known for creating Objective-C Playgrounds, Apple’s Essential Apps like Foldify and 3D Game Engines. Passionate about writing quality code and helping other do the same. He blogs on merowing.info and open sources tools/libraries on github.com/krzysztofzablocki",
			"picture": "http://2018.appbuilders.ch/images/speakers/krzysztof.jpg",
			"twitter": "merowing_",
			"speakerId": 7,
			"isStory": false
		},
		{
			"firstName": "Carola",
			"lastName": "Nitz",
			"jobTitle": "iOS developer",
			"company": "",
			"biography": "Caro is an iOS Developer with 5 years of experience working on various iOS Apps. \nShe spent the last years working on big complex projects like VLC for iOS, where she was able to gather knowledge on how to navigate matured projects with legacy code.\nThis enabled her to hone and expand her debugging and architecture skills.",
			"picture": "http://2018.appbuilders.ch/images/speakers/caro.jpg",
			"twitter": "_Caro_N",
			"speakerId": 8,
			"isStory": false
		},
		{
			"firstName": "Dave",
			"lastName": "DeLong",
			"jobTitle": "Senior iOS Engineer",
			"company": "Snap",
			"biography": "A seven-year veteran of Apple, Dave DeLong is an accomplished iOS engineer with a passion for teaching, and hacking the Objective-C runtime. During his time at Apple, he worked on the UIKit framework, Developer Evangelism, and Apple Maps. He now works at Snap, Inc. on the Snapchat app.\nDave, his family, and his large collection of bowties live near Salt Lake City, UT, where he’s an active member of the local developer community. He can often be found on Twitter teaching developers about all the ways that calendrical calculations can go wrong.",
			"picture": "http://2018.appbuilders.ch/images/speakers/dave.jpg",
			"twitter": "davedelong",
			"speakerId": 9,
			"isStory": false
		},
		{
			"firstName": "Danny",
			"lastName": "Preussler",
			"jobTitle": "Head of Mobile",
			"company": "sporttotal.tv",
			"biography": "",
			"picture": "http://2018.appbuilders.ch/images/speakers/danny.jpg",
			"twitter": "PreusslerBerlin",
			"speakerId": 10,
			"isStory": false
		},
		{
			"firstName": "Paul",
			"lastName": "Hudson",
			"jobTitle": "Creator of Hacking with Swift",
			"company": "",
			"biography": "Paul is the author of Hacking with Swift, Pro Swift, Hacking with macOS, Server-Side Swift, Swift Coding Challenges, Practical iOS 10, and Objective-C for Swift Developers. Suffice it to say, he quite likes Swift. And coffee. (But mostly Swift.) (And coffee.)",
			"picture": "http://2018.appbuilders.ch/images/speakers/paul.jpg",
			"twitter": "twostraws",
			"speakerId": 11,
			"isStory": false
		},
		{
			"firstName": "Wilfried",
			"lastName": "Mbouenda",
			"jobTitle": "Senior Android Engineer",
			"company": "Reply",
			"biography": "Wilfried is an African Android developer who like to learn and share Software development knowledge.\nWhen he isn't coding, he enjoys reading, writing, doing sports and seing TV shows.\nHis mantra is \"Work hard, play hard, rest hard\"",
			"picture": "http://2018.appbuilders.ch/images/speakers/wilfried.jpg",
			"twitter": "ewilly1",
			"speakerId": 12,
			"isStory": false
		},
		{
			"firstName": "Matthias",
			"lastName": "Tretter",
			"jobTitle": "Lead Developer",
			"company": "IdeasOnCanvas",
			"biography": "Matthias is the Lead Developer at IdeasOnCanvas, where he works on MindNode for iOS, MacOS and watchOS. He is passionate about a lot of things, but front and foremost technology, psychology and especially the intersection of both. Therefore he is equally interested in technical aspects of a product, as well as its user experience.",
			"picture": "http://2018.appbuilders.ch/images/speakers/matthias.jpg",
			"twitter": "myell0w",
			"speakerId": 13,
			"isStory": false
		},
		{
			"firstName": "Andrea",
			"lastName": "Falcone",
			"jobTitle": "Software Engineer",
			"company": "Google",
			"biography": "Andrea Falcone is a Senior Software Engineer at Google, in the Developer Products Group working on Firebase. She has been with the Crashlytics team since 2013 and has built many pieces of the tooling, including Android Studio Plugin, Crashlytics Android SDK, Gradle plugin, Beta by Crashlytics and fastlane.",
			"picture": "http://2018.appbuilders.ch/images/speakers/andrea.jpg",
			"twitter": "asfalcone",
			"speakerId": 14,
			"isStory": false
		},
		{
			"firstName": "Sebastian",
			"lastName": "Schmidt",
			"jobTitle": "Software Engineer",
			"company": "Firebase",
			"biography": "Sebastian Schmidt is an engineer on the Firebase SDK platform, working on the iOS, Android and Web SDKs for Firestore and the Realtime Database. Prior to joining Firebase, he helped Google App Engine achieve its current scale.",
			"picture": "http://2018.appbuilders.ch/images/speakers/sebastian.jpg",
			"twitter": null,
			"speakerId": 15,
			"isStory": false
		},
		{
			"firstName": "Mario",
			"lastName": "Bodemann",
			"jobTitle": "Android and Java",
			"company": "Contentful",
			"biography": "Hey, I am coorganizing the Google Developer Group Co-Organiser @Berlindroid, currently working as a Android and Java Developer @Contentful. Before, I was a Software Engineer @HERE and @Wooga. Being a Research Associate @HHIFraunhofer in my early years, I discovered my passion for Virtual Reality and Augmented Reality, which survives as a side project ever since.",
			"picture": "http://2018.appbuilders.ch/images/speakers/mario.jpg",
			"twitter": "MarioBodemann",
			"speakerId": 16,
			"isStory": false
		},
		{
			"firstName": "Adrian",
			"lastName": "Kosmaczewski",
			"jobTitle": "Writer, Software Developer and Trainer",
			"company": "AKOSMA training",
			"biography": "Adrian Kosmaczewski is a writer, a software developer and a trainer. He is the author of five books about mobile software development, and has shipped mobile, web and desktop apps for iOS, Android, Mac OS X, Windows and Linux since 1996. Adrian holds a Master in Information Technology from the University of Liverpool.\nWhen not coding or teaching, Adrian likes to spend time with his wife Claudia, his cat Max and his Olivetti Lettera 22 typewriter.",
			"picture": "http://2018.appbuilders.ch/images/speakers/adrian.jpg",
			"twitter": "akosma",
			"speakerId": 17,
			"isStory": false
		},
		{
			"firstName": "Vikram",
			"lastName": "Kriplaney",
			"jobTitle": "Mobile Tech Lead",
			"company": "local.ch & search.ch",
			"biography": "Vikram has been a mobile developer since when WAP was still cool and Symbian and J2ME were still fashionable. He founded mobile at local.ch in 2007, where he went on to develop massively successful mobile web, iOS and Android apps. Over the years, he's helped build one of the most awesome mobile engineering teams in Switzerland.\nHe's very Spanish, very Indian and increasingly Swiss – having grown up between Gran Canaria and Mumbai, he calls Zurich home.\nVikram is also a co-author of the venerable Mobile Developer's Guide To The Galaxy.",
			"picture": "http://2018.appbuilders.ch/images/speakers/vikram.jpg",
			"twitter": "krips",
			"speakerId": 18,
			"isStory": false
		},
		{
			"firstName": "Harlan",
			"lastName": "Haskins",
			"jobTitle": "Swift Compiler Contributor",
			"company": "",
			"biography": "Harlan is a student at Rochester Institute of Technology. He co-founded LLVMSwift, an organization that aims to provide Swift engineers with compiler-oriented tools. He has spent the past two summers at Apple working on Swift, and plans to return full time on the Swift compiler team.",
			"picture": "http://2018.appbuilders.ch/images/speakers/harlan.jpg",
			"twitter": "harlanhaskins",
			"speakerId": 19,
			"isStory": false
		},
		{
			"firstName": "Robert",
			"lastName": "Widmann",
			"jobTitle": "Swift Compiler Contributor",
			"company": "",
			"biography": "Robert is a student and former Mac developer turned programming language enthusiast. He is the co-founder of TypeLift, an open-source organization for publishing declarative libraries that take maximum advantage of Swift’s type system. He has spent his past two summers interning on the Swift team at Apple and is returning this year to work on the compiler frontend team.",
			"picture": "http://2018.appbuilders.ch/images/speakers/robert.jpg",
			"twitter": "codafi_",
			"speakerId": 20,
			"isStory": false
		},
		{
			"firstName": "Sasa",
			"lastName": "Sekulic",
			"jobTitle": "Android Team Lead",
			"company": "",
			"biography": "Android team leader (worked on apps with millions of downloads) with more than 15 years of experience in various development and management positions. Developed social impact and media apps with millions of users and winners of Google Awards in 2017, 2016 and 2015. Speaker at various conferences (Droidcon, CodeMobile UK). Co-author of an upcoming book on reactive programming, \"Grokking Rx\".",
			"picture": "http://2018.appbuilders.ch/images/speakers/sasa.jpg",
			"twitter": "sasa_sekulic",
			"speakerId": 21,
			"isStory": false
		},
		{
			"firstName": "Jonathan",
			"lastName": "Rothwell",
			"jobTitle": "Software Engineer",
			"company": "Zuhlke Engineering",
			"biography": "Jonathan is a software engineer whose interests include mobile apps, engineering for accessibility, and the ethical implications of software in society. In his spare time, he enjoys travel, swimming, and photography. He is also a fan of science fiction and an amateur writer, and is currently working on a second novel.",
			"picture": "http://2018.appbuilders.ch/images/speakers/jonathan.jpg",
			"twitter": "JoroDev",
			"speakerId": 23,
			"isStory": false
		},
		{
			"firstName": "Pascal",
			"lastName": "How",
			"jobTitle": "Android Developer",
			"company": "MyDrive Solutions",
			"biography": "Hi, my name is Pascal and I am an Android developer at MyDrive Solutions in London. I have a background in mechatronics and recently made the switch to Android about 2 years ago. What drove me to mobile development was the ability to develop beautiful and engaging apps that people can hold in their hands. Throughout my journey so far, I learned a lot from the people around me and now I would like to give back to the community by sharing my experiences and learnings. Some of my recent activities include talking at a Google Developer Group London Meetup and Udacity Connect event.",
			"picture": "http://2018.appbuilders.ch/images/speakers/pascal.jpg",
			"twitter": null,
			"speakerId": 24,
			"isStory": false
		},
		{
			"firstName": "Steve",
			"lastName": "Scott",
			"jobTitle": "Developer, Podcaster and Conference Organiser",
			"company": "",
			"biography": "",
			"picture": "http://2018.appbuilders.ch/images/speakers/scotty.jpg",
			"twitter": "macdevnet",
			"speakerId": 25,
			"isStory": true
		},
		{
			"firstName": "Peter",
			"lastName": "Steinberger",
			"jobTitle": "Founder and CEO",
			"company": "PSPDFKit",
			"biography": "Peter founded and bootstrapped PSPDFKit in 2011, and has since expanded the company with the goal of providing the highest quality PDF framework for all platforms. While Peter is responsible for the day-to-day management of the team, he never misses the chance to go under PSPDFKit’s hood and get his hands dirty with writing and debugging code. Peter has worked with iOS since the inception of the iPhone, and is regularly invited to speak at conferences around the world. He also organizes Cocoaheads, a meetup for developers that work with Apple platforms. Prior to PSPDFKit, he worked as a Senior iOS Engineer at a startup in San Francisco and taught iOS and Mac development at his alma mater, the Vienna University of Technology.",
			"picture": "http://2018.appbuilders.ch/images/speakers/peter.jpg",
			"twitter": "steipete",
			"speakerId": 26,
			"isStory": true
		},
		{
			"firstName": "Antonio",
			"lastName": "Carzaniga",
			"jobTitle": "Dean and Professor at USI",
			"company": "",
			"biography": "Antonio Carzaniga is a professor and a founding member (since 2004) of the Faculty of Informatics at the University of Lugano, Switzerland. From 2001 to 2007 he was an assistant research professor in the Department of Computer Science at the University of Colorado at Boulder. Antonio Carzaniga received the Laurea degree in electronics engineering and the Ph.D. degree in computer science from Politecnico di Milano, Italy.  Antonio Carzaniga's primary research interests are in the areas of distributed systems and software engineering, specifically in content-based networking, information-centric networking, distributed publish/subscribe systems, middleware, software adaptability and automatic fault tolerance, and testing. He also conducted research in software configuration management and code mobility.",
			"picture": "http://2018.appbuilders.ch/images/speakers/carzaniga.jpg",
			"twitter": null,
			"speakerId": 27,
			"isStory": true
		},
		{
			"firstName": "David",
			"lastName": "Hart",
			"jobTitle": "Lead iOS Developer",
			"company": "Atipik",
			"biography": "David Hart is the Lead iOS Developer at Atipik, a web & mobile development shop in Geneva. After beginning his career in the games industry, David reconverted to mobile development in 2009. Since then, he been crafting apps for iOS with a deep care for user experience and design. More recently, he’s shown a strong interest in Swift through participation in the Swift Evolution process and contributions to the Swift Package Manager.",
			"picture": "http://2018.appbuilders.ch/images/speakers/david.jpg",
			"twitter": "dhartbit",
			"speakerId": 28,
			"isStory": false
		},
		{
			"firstName": "George",
			"lastName": "Karavias",
			"jobTitle": "Mobile Architect",
			"company": "Cognizant",
			"biography": "George Karavias has been riding the mobile revolution wave from the get go and has had a blast creating over 25 mobile applications in the process. Currently he is obsessing over Machine Learning and Mixed Reality.",
			"picture": "http://2018.appbuilders.ch/images/speakers/george.jpg",
			"twitter": null,
			"speakerId": 29,
			"isStory": false
		},
		{
			"firstName": "Meghan",
			"lastName": "Kane",
			"jobTitle": "iOS Developer",
			"company": "Novoda",
			"biography": "GeoMeghan is an iOS developer at Novoda in their Berlin office. She is the co-creator and instructor of a Udacity course on Core ML. She takes a lifelong learning approach and is continuously researching new topics, both in software development and in the broader scientific community. Recently, she worked with physicists from CERN & Fermilab on a paper about software development in high energy physics that was published in December 2017. When not coding, she can usually be found at a coffee shop studying quantum computing 🤓, cycling 🚴🏼‍♀️ , playing board games 🎲, or excessively using emoji 🙃. In her former life, she lived in the US and studied Mathematics & CS at MIT.",
			"picture": "http://2018.appbuilders.ch/images/speakers/meghan.jpg",
			"twitter": "meghafon",
			"speakerId": 30,
			"isStory": false
		},
		{
			"firstName": "Matteo",
			"lastName": "Bonifazi",
			"jobTitle": "Google Developer Expert",
			"company": "",
			"biography": "Developed apps, for more than five billions downloads, and physical devices, for almost one billions unit sold. Mobile developer mainly focused on Android application development and keen to face new challenges. Trying to share my experience and what I’ve learnt about mobile using communities, where I am an active member, and the Google Developer Expert program (joined in April 2015).",
			"picture": "http://2018.appbuilders.ch/images/speakers/matteo.jpg",
			"twitter": "mbonifazi",
			"speakerId": 31,
			"isStory": false
		},
		{
			"firstName": "Elaine Dias",
			"lastName": "Batista",
			"jobTitle": "Team Leader & Software Engineer",
			"company": "SFEIR",
			"biography": "Elaine has been working on the mobile development world for the past 5 years as an Android and occasionally iOS developer. She's passionate about mobile development and UI/UX but has become more and more interested about new kinds of computing such as Voice Assistants and IoT. She's a Google Developer Expert for the Google Assistant.",
			"picture": "http://2018.appbuilders.ch/images/speakers/elaine.jpg",
			"twitter": "elainedbatista",
			"speakerId": 32,
			"isStory": false
		},
		{
			"firstName": "Jade",
			"lastName": "Chabaro",
			"jobTitle": "Tech Lead & Scrum Master",
			"company": "Freelance",
			"biography": "Technical leader and Scrum Master on mobile and IoT projects (Android Wear), I have a background as a mobile developer. I am passionate by mobile innovation and user experience. I help clients to express there needs and transform their ideas into reality. Since a year, I am interested in voice interface, with the help of the Google Assistant platform.",
			"picture": "http://2018.appbuilders.ch/images/speakers/jade.jpg",
			"twitter": "jadechabaro",
			"speakerId": 33,
			"isStory": false
		},
		{
			"firstName": "Tobias",
			"lastName": "Due Munk",
			"jobTitle": "Indie iOS Developer & Designer",
			"company": "",
			"biography": "iOS developer and designer from Denmark, living and working from Copenhagen. Sole proprietor doing a mix of consultant and indie work.",
			"picture": "http://2018.appbuilders.ch/images/speakers/tobias.jpg",
			"twitter": "tobiasdm",
			"speakerId": 34,
			"isStory": false
		},
		{
			"firstName": "Beatrice",
			"lastName": "Sigrist Charbonnier",
			"jobTitle": "Executive Coaching",
			"company": "Sigrist Coaching",
			"biography": "Beatrice is skilled in creating stimulating, trusting, and insightful relationships with C-Suite senior executives to help them unleash and employ more of their leadership potential. Beatrice is a Certified Coach by the International Coach Federation (ICF), an Advanced Future Core Coach, and earned her PhD in business administration from the Universities of Basel and Geneva, Switzerland (entrepreneurship: opportunity recognition). She also holds a master’s degree in sociology from the École des Hautes Études en Sciences Sociales in Paris, France, and a master’s degree in economics from the University of Berne. In addition, Beatrice is committed to high coaching standards as a member of ICF (International Coach Federation see coachfederation.org), former vice-president of the board of ICF Switzerland, currently serving as their ambassador and as a board member of the Swiss Expert Network on Burnout (burnout.ch). Further, she is a member of the European Mentoring and Coaching Council (EMCC) and an affiliate member of the Institute of Coaching Professional Association at McLean Hospital, a Harvard Medical School affiliate.",
			"picture": "http://2018.appbuilders.ch/images/speakers/beatrice.jpg",
			"twitter": null,
			"speakerId": 35,
			"isStory": true
		},
		{
			"firstName": "Stefan",
			"lastName": "Aebischer",
			"jobTitle": "Mobile Software Engineer",
			"company": "SBB",
			"biography": "Following his studies, Stefan began his career as a Mobile Software Engineer with an award-winning Swiss startup specializing in video surveillance and artificial intelligence. In his time off, Stefan, a passionate photographer, sought to teach his computer “what a good photograph looks like” so he could let the machine work for him and clean up his messy photo library. Unfortunately, algorithms and hardware weren’t that good at the time, so Stefan did it himself, the old time-intensive way. A couple of iPhone releases later, Stefan discovered Convolutional Neural Networks and got bitten by this game-changing technology. At SBB Stefan and his colleagues developed an app able to recognize most of the defect-images reported by travelers, gaining the immediate attention of top management. Will the machine finally replace Stefan?",
			"picture": "http://2018.appbuilders.ch/images/speakers/stefan.jpg",
			"twitter": "aebischers",
			"speakerId": 36,
			"isStory": false
		},
		{
			"firstName": "Reto",
			"lastName": "Schiegg",
			"jobTitle": "Data Scientist",
			"company": "SBB",
			"biography": "Reto is a data scientist at SBB/CFF/FFS where he works mainly on computer vision and image recognition. Due to the increase of computational power on smartphones, a part of Reto’s work focuses on developing computer vision algorithms on smartphones. Prior to joining the company, Reto had a part-time job as a software engineer while completing his master degree in computer science with specialization in data science at the University of Bern.",
			"picture": "http://2018.appbuilders.ch/images/speakers/reto.jpg",
			"twitter": null,
			"speakerId": 37,
			"isStory": false
		},
		{
			"firstName": "Andreas",
			"lastName": "Schlosser",
			"jobTitle": "Chief Product Owner and Lead Architect",
			"company": "SAP",
			"biography": "Andreas has 10 years experience in mobile. He was the responsible architect of SAP Mobile Platform 3.0 and with the shift towards cloud then defined the architecture of SAP Cloud Platform Mobile Services. His main focus is on service consumability and APIs. Recently, Andreas took responsibility for the SAP Cloud Platform SDK for iOS as the Chief Product Owner. In this role, his attention is on building an easy to consume, modern Swift SDK that feels natural to iOS developers and makes it easy to develop enterprise mobile applications end-to-end – from mobile app to mobile services to the backend.",
			"picture": "http://2018.appbuilders.ch/images/speakers/andreas.jpg",
			"twitter": "schlossermobile",
			"speakerId": 38,
			"isStory": false
		},
		{
			"firstName": "Florent",
			"lastName": "Pillet",
			"jobTitle": "Architect, Mobile Software Expert",
			"company": "",
			"biography": "",
			"picture": "http://2018.appbuilders.ch/images/speakers/florent.jpg",
			"twitter": "fpillet",
			"speakerId": 100,
			"isStory": false
		},
		{
			"firstName": "Aleksandar",
			"lastName": "Vacić",
			"jobTitle": "",
			"company": "",
			"biography": "",
			"picture": "http://2018.appbuilders.ch/images/speakers/aleksandar.jpg",
			"twitter": "radiantav",
			"speakerId": 101,
			"isStory": false
		},
		{
			"firstName": "Seán",
			"lastName": "Labastille",
			"jobTitle": "Software Engineer",
			"company": "FAIRTIQ",
			"biography": "",
			"picture": "http://2018.appbuilders.ch/images/speakers/sean.jpg",
			"twitter": "flufffel",
			"speakerId": 102,
			"isStory": false
		},
		{
			"firstName": "Marin",
			"lastName": "Todorov",
			"jobTitle": "Independent iOS developer, book author, trainer, and speaker",
			"company": "",
			"biography": "",
			"picture": "http://2018.appbuilders.ch/images/speakers/marin.jpg",
			"twitter": "icanzilb",
			"speakerId": 103,
			"isStory": false
		},
		{
			"firstName": "Dorin",
			"lastName": "Danciu",
			"jobTitle": "Cocoa Junkie",
			"company": "",
			"biography": "",
			"picture": "http://2018.appbuilders.ch/images/speakers/dorin.jpg",
			"twitter": "dorindanciu",
			"speakerId": 104,
			"isStory": false
		},
		{
			"firstName": "Nataliya",
			"lastName": "Patsovska",
			"jobTitle": "Tech Lead",
			"company": "iZettle",
			"biography": "",
			"picture": "http://2018.appbuilders.ch/images/speakers/nataliya.jpg",
			"twitter": "nataliya_bg",
			"speakerId": 105,
			"isStory": false
		},
		{
			"firstName": "Michele",
			"lastName": "Marchetti",
			"jobTitle": "Mobile Architect",
			"company": "Appway",
			"biography": "",
			"picture": "http://2018.appbuilders.ch/images/speakers/michele.jpg",
			"twitter": "MarchettiMikele",
			"speakerId": 106,
			"isStory": false
		},
		{
			"firstName": "Josselin",
			"lastName": "Pello",
			"jobTitle": "",
			"company": "",
			"biography": "",
			"picture": "http://2018.appbuilders.ch/images/speakers/josselin.jpg",
			"twitter": "JosselinPello",
			"speakerId": 107,
			"isStory": false
		}
	],
	"talks": [
		{
			"description": "",
			"title": "🎫 Registration",
			"time": "08:30",
			"speaker": null,
			"room": "Entrance Hall",
			"day": "Monday 16th"
		},
		{
			"description": "A discussion about why App Stores have guidelines, how apps are reviewed, what reviewers are looking for, and what the common mistakes are. In this talk, I will give you tips and tricks necessary to avoid problems on the App Store and Google Play.",
			"title": "Lessons Learned from the App Store",
			"time": "09:30",
			"speaker": 5,
			"room": "Firebase Room",
			"day": "Monday 16th"
		},
		{
			"description": "",
			"title": "Work-life Balance & Burnout",
			"time": "10:10",
			"speaker": 35,
			"room": "Firebase Room",
			"day": "Monday 16th"
		},
		{
			"description": "Let’s talk about the things that really matter for maintainable architecture in iOS apps",
			"title": "iOS Application Architecture",
			"time": "10:50",
			"speaker": 7,
			"room": "Firebase Room",
			"day": "Monday 16th"
		},
		{
			"description": "It'll be talked about how and why to build an Android Instant App. With Android Instant Apps, activities of your app can you can be launched without prior installation of the app.",
			"title": "Building an Instant App",
			"time": "10:50",
			"speaker": 50,
			"room": "Cryms Room",
			"day": "Monday 16th"
		},
		{
			"description": "",
			"title": "☕️ Coffee Break",
			"time": "11:20",
			"speaker": null,
			"room": "Entrance Hall",
			"day": "Monday 16th"
		},
		{
			"description": "Users demand the same awesome user experience they get from their consumer apps also when it comes to business apps. SAP offers the complete toolset to build great native iOS apps on top of SAP backends. We will give a quick overview of the whole stack from on-premise backends and cloud-based mobile services to the native Swift SDK, so that we can then dive deeper into the tools for mobile development. We will browse the rich set of enterprise UI controls, generate a working app with the SAP Cloud Platform SDK for iOS Assistant in a couple minutes and examine the code in a bit more detail.",
			"title": "Native iOS Apps for the Enterprise with SAP",
			"time": "11:40",
			"speaker": 38,
			"room": "Firebase Room",
			"day": "Monday 16th"
		},
		{
			"description": "Testing an app on your perfect Pixel 2, under perfect network conditions works great, but you're getting reports of strange behavior from the wild and weird crashes that you can't reproduce. This talk will walk through some of the more complex options on the Developer Options screen in the Android OS and discuss how a developer can use them to debug problems in their application. Topics covered include: showing surface updates to help you find layout loops in your app, showing layout bounds to get your views pixel perfect, and aggressively killing processes and activities to ensure that your app performs well under stress. We'll cover these options and more as we dive deep into debugging apps with tools included on the device.",
			"title": "Exploring Android Developer Options",
			"time": "11:40",
			"speaker": 14,
			"room": "Cryms Room",
			"day": "Monday 16th"
		},
		{
			"description": "There are many different ways to build your apps, and each approach brings its own set of challenges and pitfalls. Recent years have seen the emergence of patterns like MVVM, VIPER, FRP, and ReactNative that attempt to solve some of MVC’s problems.\nIn this talk, we’ll explore a simple modification to MVC that will allow you to easily avoid its most common problems without having to fight the frameworks.",
			"title": "A Better MVC",
			"time": "12:20",
			"speaker": 9,
			"room": "Firebase Room",
			"day": "Monday 16th"
		},
		{
			"description": "With RxJava you can write some complex, multithreaded code - and testing it is easy!",
			"title": "Testing and RxJava 2",
			"time": "12:20",
			"speaker": 21,
			"room": "Cryms Room",
			"day": "Monday 16th"
		},
		{
			"description": "",
			"title": "🍝 Lunch Break",
			"time": "13:00",
			"speaker": null,
			"room": "Entrance Hall",
			"day": "Monday 16th"
		},
		{
			"description": "",
			"title": "⚡️ Talk - Apple MDM and Kiosk applications",
			"time": "14:00",
			"speaker": 100,
			"room": "Entrance Hall",
			"day": "Monday 16th"
		},
		{
			"description": "",
			"title": "⚡️ Talk - One nice trick to solve way too many Auto Layout issues",
			"time": "14:05",
			"speaker": 101,
			"room": "Entrance Hall",
			"day": "Monday 16th"
		},
		{
			"description": "",
			"title": "⚡️ Talk - Using the Swift Package Manager on iOS: How to build a MongoDB client with MongoKitten",
			"time": "14:10",
			"speaker": 102,
			"room": "Entrance Hall",
			"day": "Monday 16th"
		},
		{
			"description": "",
			"title": "⚡️ Talk - Launching a mac app",
			"time": "14:15",
			"speaker": 103,
			"room": "Entrance Hall",
			"day": "Monday 16th"
		},
		{
			"description": "A lot of ink has been spilt and electrons displaced overcomplicating object-oriented programming and design. Authors, consultants and architects twist themselves into knots debating whether squares are rectangles and how to represent that both buses and cars have engines and drivers but so do horses but horses are also mammals like dogs. My assertion is that hiding among all of this is a very simple idea, based on a couple of small principles. Let's start OO again, please.",
			"title": "Rethinking Object-Oriented Design",
			"time": "14:30",
			"speaker": 3,
			"room": "Firebase Room",
			"day": "Monday 16th"
		},
		{
			"description": "Dependency Injection via frameworks like Dagger were present in most modern Android projects.\nBut then Kotlin happened. And since then a bunch of new libraries like Koin or Kodein appeared. Developers are even writing articles how to do DI without any framework.\nSome argue that those don’t even offer real dependency injection. Let’s look at that argument and compare the approaches.\nSo, is there something wrong with Dagger & co. in Kotlin? Are they obsolete? What are the alternatives? Let’s dive in.",
			"title": "To Inject or not inject - Dependency injection in a Kotlin world",
			"time": "14:30",
			"speaker": 10,
			"room": "Cryms Room",
			"day": "Monday 16th"
		},
		{
			"description": "Swift is a landmark open-source project with hundreds of contributors and many many times more users. The Swift community is full of intelligent, insightful users ready to contribute their voice to the project. Join Harlan and Robert, two former interns on the Swift team, on a journey from checking out source to closing a Swift bug report, live! Along the way, learn about core concepts, tips, and best practices for effectively making your mark on the Swift project.\nThis talk is going to be presented by Harlan Haskins and Robert Widmann.",
			"title": "Becoming An Effective Contributor to Swift",
			"time": "15:10",
			"speaker": 19,
			"room": "Firebase Room",
			"day": "Monday 16th"
		},
		{
			"description": "Are we sure React Native is just a shortcut for Javascript developers to develop mobile app? How a native mobile developer can use React Native in their apps. We will dive into the pitfall & benefit to develop mobile app with this new approach.",
			"title": "How can I React native my Android mobile app?",
			"time": "15:10",
			"speaker": 31,
			"room": "Cryms Room",
			"day": "Monday 16th"
		},
		{
			"description": "",
			"title": "System Scalability",
			"time": "15:50",
			"speaker": 27,
			"room": "Firebase Room",
			"day": "Monday 16th"
		},
		{
			"description": "",
			"title": "☕️ Coffee Break",
			"time": "16:30",
			"speaker": null,
			"room": "Entrance Hall",
			"day": "Monday 16th"
		},
		{
			"description": "Did you ever think your awesome new app would get you into a legal pickle? Vikram tells a true story with bits of code and some crucial advice on how to survive such an ordeal.",
			"title": "The Little App that Got Us into Big Trouble",
			"time": "16:50",
			"speaker": 18,
			"room": "Firebase Room",
			"day": "Monday 16th"
		},
		{
			"description": "You can never really know just how secure your app is until you've done your best trying to break it.\nIn a world where building apps is similar to playing with Legos, the sturdiness and stability of our creations is mostly tested by others. Unfortunately, this places our users at risk of exposing their data into potentially harmful hands.\nLet's dive together and explore a series of practical, hands-on examples on how to explore an app, dismantle it and alter it in a way it wasn't intended to be.",
			"title": "Break you app before someone else does",
			"time": "16:50",
			"speaker": 4,
			"room": "Cryms Room",
			"day": "Monday 16th"
		},
		{
			"description": "We as developers are spending 50% of our time either fixing bugs or making code work.\nIn this talk we’re going over breakpoints, commands, arguments and tools that will help you be more efficient and faster when debugging your Apps.",
			"title": "Advanced Debugging Techniques your senior hasn’t told you about",
			"time": "17:30",
			"speaker": 8,
			"room": "Firebase Room",
			"day": "Monday 16th"
		},
		{
			"description": "Ever since Google has announced full Kotlin support for writing Android apps at I/O 2017, the language has taken the world by storm and many companies have started adopting it as their language of choice for Android development. One of the new exciting features introduced by Kotlin to Android are extension functions. In this talk, you will get an overview on how to create and use extension functions in your Kotlin code as well as how it interops with existing Java code. You will then be taken on a tour across common areas of Android where extension functions work wonders in making your code more concise and less prone to bugs. Transitioning from Java to Kotlin can be tricky so we will go through some of the best practices when doing the migration. By the end of the session, you will have a better understanding on what Kotlin and extension functions can do for you as well as some of the pitfalls that need to be kept in mind.",
			"title": "Kotlin Extension Functions and Beyond",
			"time": "17:30",
			"speaker": 24,
			"room": "Cryms Room",
			"day": "Monday 16th"
		},
		{
			"description": "One of the best things about being a developer these days is the awesome communities that are built up around the technologies we work with. Whether you’re an iOS or Android developer, there’s always blogs to read, open source to use and conferences to attend. But getting started contributing to the community yourself, and sharing parts of your own work, is not always easy (in fact, it can be quite scary!). In this talk, John will talk about his experiences (and share lots of tips!) of starting a blog, a podcast, working on open source and sharing work in other ways.",
			"title": "Sharing",
			"time": "18:00",
			"speaker": 2,
			"room": "Firebase Room",
			"day": "Monday 16th"
		},
		{
			"description": "",
			"title": "🎉 Conference Party",
			"time": "19:30 - 24:00",
			"speaker": null,
			"room": "Seven - The Lounge",
			"day": "Monday 16th"
		},
		{
			"description": "At Firebase, we make app development easy. We will show you how we make products mobile-friendly and what it takes to turn an existing backend service into a fully-blown product that's ready for iOS, Android and the Web.\nFollow along as we take a service that fulfills trillions of queries per month and add the features that you need on a daily basis.",
			"title": "Why We Build Products",
			"time": "09:30",
			"speaker": 15,
			"room": "Firebase Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "",
			"title": "Entrepreneurship",
			"time": "10:10",
			"speaker": 26,
			"room": "Firebase Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "The Swift generics system is extremely powerful. Protocols with associated types are everywhere and allow us to abstract over types with hidden type information. But they come with their complexity tax. Join David Hart in a journey through Swift's generics to better understand PATs, discover ways to overcome them, and how future Swift might resolve most of those issues.",
			"title": "Swift Generics - The 5 Stages of PATs",
			"time": "10:50",
			"speaker": 28,
			"room": "Firebase Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "🏴‍☠️ ARrrrg! 🏴‍☠️ This was my first reaction reading through the code of the sample provided by Google for it's new ARCore. After the first shock, I took a close look on how the app works, and what ARCore could do for my use case: Having my virtual collection of toy figures always with me ❤️. 🤖🤴 In this talk, I will talk about Augmented Reality, walk through the current demo app for ARCore on Android and purpose a different way of writing the app, extending it to be able to read different models at different times ... Expect a bit of Computer💻 Graphics🖼️ terminology🔬, source code watching🔭, Pirates🏴‍☠️, and more lame jokes😆.",
			"title": "ARrrrg! The Google AR Android Demo Application deciphered",
			"time": "10:50",
			"speaker": 16,
			"room": "Cryms Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "",
			"title": "☕️ Coffee Break",
			"time": "11:20",
			"speaker": null,
			"room": "Entrance Hall",
			"day": "Tuesday 17th"
		},
		{
			"description": "It's easy to rely on tools and techniques you've always used, but if you do that you're missing out on all the great new features Apple has introduced in newer iOS versions. In this session you'll learn how to take advantage of features introduced in iOS 9, 10, and 11 to make your apps look and work better with little effort.",
			"title": "How to Build a Modern iOS App: Wide color, 3D Touch, Spotlight, and more",
			"time": "11:40",
			"speaker": 11,
			"room": "Firebase Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "Flutter is a Framework developed and used by Google using Dart and a C++ engine to create Mobile Applications writing code only once. With Flutter you can write code only once and release it in the appstore and in the playstore. With Flutter you prototype, develop and release faster. This Talk will teach us the importance of Flutter, its most important features and finally how it works. The talk will end with an example of a simple application developed in Flutter.",
			"title": "Want a faster mobile development? Flutter is the way!",
			"time": "11:40",
			"speaker": 12,
			"room": "Cryms Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "In a perfect world many of us would choose to have a 100 % Swift codebase, while others would choose to have a 100 % Objective-C codebase - both of which are perfectly fine. Would you choose to maintain a mixed codebase? Probably not, but that‘s the reality many of us live in. Legacy Code, don‘t we all love it?\nWhile Mix & Match between Swift and Objective-C works great out of the box, there are many rough edges. Let‘s explore some tricks we can use to bring first-class APIs to both worlds - restoring our sanity, and harmony between both languages.",
			"title": "Swift & Objective-C: The most adventurous mashup since „Avengers: Infinity War“",
			"time": "12:20",
			"speaker": 13,
			"room": "Firebase Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "The Google Assistant - your own Google, always ready to help - and its developer platform have been out for more than a year.\nBesides controlling your music, lights and asking about the weather, Assistant apps have been struggling to get into the users’ daily routine. It is time for you to be on the forefront of the revolution by adding some conversational features in your mobile app.\nIn this talk, we’re going to explain how you can implement a custom conversational feature in your existing Android or iOS app. Today, mobile apps are the medium people use to get their information and get things done, and is the perfect way of getting them used to this new world of conversational apps.\nGoogle is really pushing this new platform forward by adding a plethora of new features to the Google Assistant such as support for more languages, family-friendly apps, an improved app directory and making it available on a lot of devices, from your phone to cars and smart speakers.",
			"title": "Adding conversational features to your mobile app",
			"time": "12:20",
			"speaker": 32,
			"room": "Cryms Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "",
			"title": "🍝 Lunch Break",
			"time": "13:00",
			"speaker": null,
			"room": "Entrance Hall",
			"day": "Tuesday 17th"
		},
		{
			"description": "",
			"title": "⚡️ Talk - Jumpstarting localization using AppleGlot4",
			"time": "14:00",
			"speaker": 104,
			"room": "Entrance Hall",
			"day": "Tuesday 17th"
		},
		{
			"description": "",
			"title": "⚡️ Talk - Tasty cakes have complicated recipes",
			"time": "14:05",
			"speaker": 105,
			"room": "Entrance Hall",
			"day": "Tuesday 17th"
		},
		{
			"description": "",
			"title": "⚡️ Talk - Review your own code with Android Lint",
			"time": "14:10",
			"speaker": 106,
			"room": "Entrance Hall",
			"day": "Tuesday 17th"
		},
		{
			"description": "In the last 6 months, I went from knowing nothing about Android to having a highly-rated and profitable app with 20k+ downloads on the Play Store. During this joyful time, I found that building your own app and putting it on the store is actually the most fulfilling and complete way to learn mobile development. Seeing your app users' positive feedback keeps you motivated, seeing their crashes makes you care much more about memory management, and getting requests from them keeps you busy learning new things.",
			"title": "⚡️ Talk - Building your app, or being built by it?",
			"time": "14:15",
			"speaker": 107,
			"room": "Entrance Hall",
			"day": "Tuesday 17th"
		},
		{
			"description": "When is it valuable to consider using machine learning to help solve your iOS app’s problems? We will go through criteria to evaluate that, practical use cases of incorporating ML models on device, and how to bootstrap the training process for creating machine learning models that will run on device (iOS).\nUsing techniques such as transfer learning and taking inspiration from the plentiful resources from industry and academia, you can get started doing this now. In this talk, we will go through some examples across different domains, and, yes, we will move beyond the dog / cat classifier.",
			"title": "Bootstrapping the Machine Learning Training Process",
			"time": "14:30",
			"speaker": 30,
			"room": "Firebase Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "In a post-truth world, software doesn’t have to be malicious to be dangerous. For example, in 2016, Facebook replaced its (human) news editors with an algorithm. Within days, conspiracy theories were at the top of the trending feeds, presented as 'news.'\n\nIn this talk, we'll discuss the ethical considerations of building software in a world that looks more like an unfolding episode of 'Black Mirror' with every passing week. No software exists in a vacuum. As developers, we have to understand the social implications of our software to help us make ethical decisions about what we get involved in, and how we build software in general. And we have to be brave and speak up when we think something could go wrong. And, if someone else speaks up, we must be willing to listen.\n\nIn short: we must be humble, we must be watchful, and we must ensure the decisions we make mean we can sleep at night.",
			"title": "So You Can Sleep At Night - ethics in software engineering",
			"time": "14:30",
			"speaker": 23,
			"room": "Cryms Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "The year 2018 marks the the 10th anniversary of the iOS SDK. To celebrate the occasion, we will explore the the history of iOS, starting with the introduction of iPhone OS 2 in 2008 and working our way forward to the present day.",
			"title": "iOS: 10 years in review",
			"time": "15:10",
			"speaker": 1,
			"room": "Firebase Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "SBB and its employees are committed to ensuring that 1.25 million travelers reach their destinations safely, punctually and comfortably every day. Travelers have the option of reporting defects and dirty rolling stock or train stations simply using the SBB Mobile app. In order for SBB to clearly identify and assign the issue for repair, travelers must specify information about the car, or ticket machine and station.\n\nIn this talk you will learn how we simplified the reporting process using deep learning. The goal is to enable travelers to identify and report defects using only their smartphone camera.\n\nThe initial neural network was trained on a base of 20k images. It continuous to learn from new images that arrive every day. The trained model is only 14 MB in size, runs locally on iOS and Android, and recognizes already more than 100 defects. This talk explains our technical approach and some best practices in Deep Learning for mobile devices.\nThis talk is going to be presented by Reto Schiegg and Stefan Aebischer.",
			"title": "How to succeed in teaching neural networks",
			"time": "15:10",
			"speaker": 36,
			"room": "Cryms Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "Mobile has always been driven forward by a plentitude of sensors like GPS, motion, and camera. With the advent of depth sensing technologies new possibilities open up for apps.\nWatch and learn intricate details and loads of use cases through an immersive and interactive talk packed with 80s visuals and audio.",
			"title": "Into the Deep – or what would 80s have done with depth sensing technology?",
			"time": "15:50",
			"speaker": 34,
			"room": "Firebase Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "In this talk we will explore how to use CoreML to drive an RC car around a track. We will explain the challenges we had during the project, about the hardware and the software. We will go into details in how we reached the final status and discuss the pro and cons of CoreML.",
			"title": "Can CoreML drive an (RC) car?",
			"time": "15:50",
			"speaker": 29,
			"room": "Cryms Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "",
			"title": "☕️ Coffee Break",
			"time": "16:30",
			"speaker": null,
			"room": "Entrance Hall",
			"day": "Tuesday 17th"
		},
		{
			"description": "After having explored personal growth in 'Being a Developer at 40', and professional change in 'The Developer Guide to the Galaxy', Adrian will delve into the third installment of his manifesto for software developers, hoping for us to tackle the larger problems of our modern society with passion, hope and, yes, some dark humor, too.",
			"title": "A Quest for a Better World",
			"time": "16:50",
			"speaker": 17,
			"room": "Firebase Room",
			"day": "Tuesday 17th"
		},
		{
			"description": "",
			"title": "🏆 Closing Ceremony",
			"time": "17:30",
			"speaker": null,
			"room": "Firebase Room",
			"day": "Tuesday 17th"
		}
	],
	"news": [
		{
			"title": "Let's party!",
			"content": "After dinner, feel free to drop by between 7:30pm and 12:00am for a free drink with us at Seven Lugano. Just enter the bar and show your badge to access our reserved first floor.",
			"date": "16th April 2018"
		},
		{
			"title": "Today is the day!",
			"content": "Hello! Registration today will start at 8.30 and breakfast will be served in the venue. We would like to ask you to prepare your ti.to ticket QR code to speed up the check-in process. WiFi is up and running too with the password 'appbuilders2018'. See you later!",
			"date": "16th April 2018"
		},
		{
			"title": "Only 1 week to go!",
			"content": "We are very excited to welcome you in Lugano next week. We have just published a last-minute change to the schedule which should now be complete.",
			"date": "8th April 2018"
		},
		{
			"title": "Welcome to App Builders 2018!",
			"content": "Only a few months left until the third edition of App Builders is going to take place in Lugano, Switzerland.",
			"date": "1st January 2018"
		}
	]
}